# GetRebarConstraintsManager Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
Rebar..::..GetRebarConstraintsManager Method
Rebar Class See Also
---
Returns an object for managing the external constraints on the Rebar element
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarConstraintsManager GetRebarConstraintsManager()
```

Visual Basic
---
```text
Public Function GetRebarConstraintsManager As RebarConstraintsManager
```

Visual C++
---
```text
public:
RebarConstraintsManager^ GetRebarConstraintsManager()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The Rebar element does not have external constraints that can be edited. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace